<script setup lang="ts">
import Card from 'primevue/card';
</script>

<template>
  <Card>
    <template #content>
      <h3>Що таке Аґрегатор?</h3>
      <p>
        Вебсайт Аґрегатор - це інноваційний онлайн-інструмент, який спрощує процес вибору служби доставки в Україні,
        надаючи користувачам зручний спосіб порівняння цін та послуг від провідних компаній, таких як Укрпошта, Нова
        Пошта та Делівері. Завдяки інтеграції API цих служб, Аґрегатор автоматично збирає та аналізує актуальну
        інформацію про тарифи та умови доставки, дозволяючи користувачам з легкістю порівнювати варіанти та вибирати
        найбільш вигідний для своїх потреб.
      </p>
      <p>
        Окрім цього, Аґрегатор пропонує функціонал універсального трекінгу посилок. Завдяки інтеграції з AfterShip API,
        користувачі можуть відстежувати статус своїх відправлень з різних служб доставки в одному місці. Це не тільки
        забезпечує зручність та економію часу, але й надає додатковий рівень контролю над процесом доставки.
      </p>
      <p>
        Загалом, Аґрегатор - це міст між користувачем та службами доставки, який пропонує простий, інтуїтивно зрозумілий
        інтерфейс, ефективні інструменти для порівняння та відстеження, а також оновлення даних в реальному часі, що
        робить його незамінним помічником у сфері логістики.
      </p>
    </template>
  </Card>
</template>
