<script setup lang="ts">
import Accordion from 'primevue/accordion';
import AccordionTab from 'primevue/accordiontab';
</script>

<template>
  <div class="wrapper">
    <h1>Про нас</h1>

    <Accordion class="accordion" :multiple="true" :activeIndex="[]">
      <AccordionTab header="Що таке Аґрегатор?">
        <p>
          "Аґрегатор" - це онлайн-сервіс, який дозволяє порівнювати ціни та умови доставки від провідних служб доставки
          в Україні, таких як Укрпошта, Нова Пошта та Делівері, а також надає можливість відстежувати посилки з цих
          служб у одному місці.
        </p>
      </AccordionTab>
      <AccordionTab header="Як працює порівняння цін на Аґрегаторі?">
        <p>
          Наш сайт використовує API різних служб доставки для отримання актуальної інформації про ціни та умови
          доставки. Ви просто вводите параметри своєї посилки, і ми показуємо вам порівняльні варіанти від різних
          компаній.
        </p>
      </AccordionTab>
      <AccordionTab header="Чи безпечно використовувати Аґрегатор для відстеження посилок?">
        <p>
          Так, цілком безпечно. Ми використовуємо захищені API-з'єднання для збору інформації про статус вашої посилки,
          гарантуючи конфіденційність та безпеку ваших даних.
        </p>
      </AccordionTab>
      <AccordionTab header="Чи є послуги Аґрегатора безкоштовними?">
        <p>Так, наш сервіс порівняння цін та відстеження посилок є повністю безкоштовним для користувачів.</p>
      </AccordionTab>
      <AccordionTab header="Як часто оновлюється інформація на сайті?">
        <p>Інформація оновлюється в реальному часі завдяки нашій інтеграції з API служб доставки та AfterShip.</p>
      </AccordionTab>
      <AccordionTab header="Чи можу я відстежувати міжнародні посилки через Аґрегатор?">
        <p>
          Наша основна функціональність зосереджена на внутрішніх доставках в Україні, але ми плануємо розширити
          можливості для відстеження міжнародних посилок у майбутньому.
        </p>
      </AccordionTab>
      <AccordionTab header="Як я можу зв'язатися з підтримкою Аґрегатора?">
        <p>
          Для зв'язку з нашою службою підтримки, будь ласка, напишіть нам на
          <a href="mailto:oleksandrhumeniuk2@gmail.com">пошту</a>
        </p>
      </AccordionTab>
      <AccordionTab header="Чи можу я довіряти порівнянню цін на Аґрегаторі?">
        <p>
          Так, наш сервіс забезпечує об'єктивне та актуальне порівняння, оскільки ми використовуємо офіційні дані,
          надані службами доставки через їх API.
        </p>
      </AccordionTab>
      <AccordionTab header="Чи може Аґрегатор гарантувати точність інформації?">
        <p>
          Ми прагнемо забезпечити максимальну точність, але важливо розуміти, що інформація може змінюватися.
          Рекомендуємо перевіряти інформацію безпосередньо на сайтах служб доставки перед здійсненням відправлення.
        </p>
      </AccordionTab>
      <AccordionTab header="Чи можу я залишити відгук або пропозиції щодо Аґрегатора?">
        <p>
          Звісно, ми завжди відкриті до відгуків та пропозицій. Будь ласка, напишіть свій відгук нам на
          <a href="mailto:oleksandrhumeniuk2@gmail.com">пошту</a>
        </p>
      </AccordionTab>
    </Accordion>
  </div>
</template>

<style scoped lang="scss">
p {
  margin: 0;
}

.wrapper {
  display: flex;
  flex-direction: column;
  gap: 32px;
}

.accordion {
  display: flex;
  flex-direction: column;
  gap: 16px;
}
</style>
